//terminal.integrated.cwd                                                     команда для изменения папки в терминале 
//git init                                                                    инициализация гит репозитория
//git status                                                                  проверка отслеживаемых и неотслеживаемых файлов
//git add -A                                                                  добавление всех файлов в гит репозиторий
//git add script.js                                                           добавление отдельного файла в гит репозиторий 
//git branch name                                                             создаение ветки коммита где name имя новой ветки
//git checkout -b name                                                        создаение ветки коммита с автоматическим переходом на новую ветку
//git merge name                                                              слияние веток между собой где name имя ветки которую мы добавляем в текущий коммит      
//git commit -a -m"20.06.2022"                                                создание контрольной точки (сохранения) в репозитории
//git log                                                                     просмотр логов (истории) изменения репозитория 
//git checkout name                                                           возвращение к нужному коммиту по имени ветки
//git checkout fbfcad86ad3d14501472b13fa94f6ca2ce965068                       возвращение к нужному коммиту по тегу коммита
//git remote add origin https://github.com/Draggsbonys/Cheat-sheets-JS.git    связывание локального репозитория с удаленным 
//git clone                                                                   добавление удаленного репозитория на компьютер   
//git pull                                                                    получение изменений с удаленного репозитория на локальный   

//Добавление файлов из локального репозитория в удаленный репозиторий
//git remote add origin https://.........
//git branch -M main
//git push -u origin main
